Revit 2027 API
DisplayStyle Enumeration
 Display type of the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DisplayStyle
Public Enumeration DisplayStyle
public enum class DisplayStyle
type DisplayStyle
Members
Member name | Value | Description
FlatColors | 7 |  Flat Colors
HLR | 2 |  Hidden Line Removal
Realistic | 6 |  Realistic
RealisticWithEdges | 8 |  Realistic With Edges
Rendering | 5 |  Rendering
Shading | 3 |  Shading
ShadingWithEdges | 4 |  Shading With Edges
Textures | 9 |  Textures
Undefined | 0 |  View does not use Render Type
Wireframe | 1 |  Wireframe
See Also
Reference
Autodesk.Revit.DB Namespace